# IFC_DMIsPSetFldEmpty

## Description
Checks if specified Field for IfcEntry's PSet is Empty.

```pascal
FUNCTION IFC_DMIsPSetFldEmpty(
				strObjectName : STRING;
				strEntryName  : STRING;
				strPSetName   : STRING;
				strFieldName  : STRING): BOOLEAN;
```

```python
def vs.IFC_DMIsPSetFldEmpty(strObjectName, strEntryName, strPSetName, strFieldName):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|strObjectName|STRING|   |
|strEntryName|STRING|   |
|strPSetName|STRING|   |
|strFieldName|STRING|   |

## Version
Availability: from Vectorworks 2021

## Category
* IFC